Merge pull request #52 from Leftbrained-Inc/bulkabuka-actualization
