--- a/README.md
+++ b/README.md
@@ -18,47 +18,37 @@
 
 > Обновляется по мере разработки
 
-```plantuml
-@startuml
-package "Native Startup"{
-folder desktopApp{
-[build.gradle.kts] --> [main.kt]
-}
-}
-folder "Shared"{
-folder commonMain {
-[main.desktop.kt]
-folder core
-folder ui
-folder resources
-folder models
+```mermaid
+graph TD
+    subgraph startup["Native Startup"]
+        subgraph desktopApp["demos/desktop_test"]
+        fileA("build.gradle.kts")
+        fileB("main.kt")
+        fileA --> fileB
+        end
+    end
 
-     core --> [main.desktop.kt]
-     ui --> [main.desktop.kt]
-     resources --> [main.desktop.kt]
-     models --> [main.desktop.kt]
-}
-folder desktopMain{
-[App.kt]
-}
-desktopMain --> commonMain :  осуществляет
-}
+    subgraph Shared
+        subgraph common["commonMain"]
+        folderD("core")
+        folderE("ui")
+        folderF("resources")
+        folderG("models")
+        dsl("DSL + Configuration")
+        folderD --> dsl
+        folderE --> dsl
+        folderF --> dsl
+        folderG --> dsl
+        end
 
-Shared --> "Native Startup"
+        subgraph desktop["desktopMain"]
+            mainDesktop("main.desktop.kts")
+        end
+        desktop -->|Native functions| common 
+    end
 
-legend
-В commonMain - код который работает на всех системах.
-При этом для каждой системы можно одни и теже
-функции реализовать по разному в своих файлах Shared.
-end legend
-@enduml
+    Shared --> startup
 ```
-
-![Диаграмма структуры проекта в PlantUML](images/structure.jpg)
-
